fix: map sorting
